Дипломный_проект/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломный_проект/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВКМ_Год = ТекущаяДата();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)
	ПроверкаДнейОтпуска();
КонецПроцедуры


&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)
	ПроверкаДнейОтпуска();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)
		АдресВХ = ПоместитьТЧВоВременноеХранилищеНаСервере();

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВХ", АдресВХ);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_АнализГрафика", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ПроверкаДнейОтпуска()
	ТекСтрока = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	Если Не КонтрольЗаполненияДат(ТекСтрока) Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока.ВКМ_ДнейОтпуска = (НачалоДня(ТекСтрока.ВКМ_ДатаОкончания) - НачалоДня(ТекСтрока.ВКМ_ДатаНачала)) / (60 * 60
		* 24);
	ПолучитьДанныеРасчетаДнейОтпуска(ТекСтрока.ВКМ_Сотрудник, ТекСтрока.ВКМ_ДатаНачала, ТекСтрока.ВКМ_ДатаОкончания);
КонецПроцедуры
 
 &НаКлиенте
Функция КонтрольЗаполненияДат(ТекСтрока)
	ДатаНачала = ТекСтрока.ВКМ_ДатаНачала;
	ДатаОкончания = ТекСтрока.ВКМ_ДатаОкончания;

	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		НачалоГода = НачалоГода(Объект.ВКМ_Год);
		КонецГода = КонецГода(Объект.ВКМ_Год);

		Если Не ((ДатаНачала >= НачалоГода И ДатаНачала <= КонецГода) И (ДатаОкончания >= НачалоГода И ДатаОкончания
			<= КонецГода)) Тогда
			ТекСтрока.ВКМ_ДатаНачала = Дата(1, 1, 1);
			ТекСтрока.ВКМ_ДатаОкончания = Дата(1, 1, 1);
			Возврат Ложь;
		КонецЕсли;
		Если НачалоДня(ДатаНачала) < НачалоДня(ДатаОкончания) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаСервере
Процедура ПолучитьДанныеРасчетаДнейОтпуска(Сотрудник, ДатаНачала, ДатаОкончания)

	Отбор = Новый Структура("ВКМ_Сотрудник", Сотрудник);
	НайденыеСтроки = Объект.ВКМ_ОтпускаСотрудников.НайтиСтроки(Отбор);
	Для Каждого Строка Из НайденыеСтроки Цикл
		Строка.ВКМ_ДнейОтпуска = (НачалоДня(Строка.ВКМ_ДатаОкончания) - НачалоДня(Строка.ВКМ_ДатаНачала)) / (60 * 60 * 24);
	КонецЦикла;
	ТаблЗнач = Объект.ВКМ_ОтпускаСотрудников.Выгрузить(Отбор);
	ИтогКоличествоДней = ТаблЗнач.Итог("ВКМ_ДнейОтпуска");
	Количество = НайденыеСтроки.Количество();
	Номер = 1;
	Для Каждого Строка Из НайденыеСтроки Цикл
		Строка.ВКМ_ДнейОтпуска = ИтогКоличествоДней;
		Если ИтогКоличествоДней > 28 И Номер = Количество Тогда
			ТекстШаблона = СтрШаблон("Превшен лимит 28 дней, на %1 д.", ИтогКоличествоДней - 28);
			ОбщегоНазначения.СообщитьПользователю(ТекстШаблона, , "Объект.ОтпускаСотрудников[" + (Строка.НомерСтроки - 1)
				+ "].ДатаОкончания");
		КонецЕсли;
		Номер = Номер + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПоместитьТЧВоВременноеХранилищеНаСервере()
	ТаблицаЗначенийТовары = Объект.ВКМ_ОтпускаСотрудников.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначенийТовары);
КонецФункции
